Repository: serdarozkan41/Do
Catalog: Do.TikTokDownloader/Do.TikTokDownloader/Resources/AppResources.*.resx
Languages: hi, id, pt, ru

# AccessDesc
source: The download requires permission. The application will not work properly in case you do not allow it.
hi: डाउनलोड की अनुमति की आवश्यकता है। यदि आप इसकी अनुमति नहीं देते हैं तो एप्लिकेशन ठीक से काम नहीं करेगा।
id: Pengunduhan memerlukan izin. Aplikasi tidak akan berfungsi dengan baik jika Anda tidak mengizinkannya.
pt: O download requer permissão. O aplicativo não funcionará corretamente caso você não permita.
ru: Загрузка требует разрешения. Приложение не будет работать должным образом, если вы не разрешите это.

# Again
source: Previously downloaded recording.
hi: पहले डाउनलोड की गई रिकॉर्डिंग।
id: Rekaman yang diunduh sebelumnya.
pt: Gravação baixada anteriormente.
ru: Ранее загруженная запись.

source: Dashboard
hi: डैशबोर्ड
id: Dasbor
pt: Painel
ru: Приборная доска

# Delete
source: Tap here to delete
hi: मिटाने के लिए यहां टैप करें
id: Ketuk di sini untuk menghapus
pt: Toque aqui para excluir
ru: Нажмите здесь, чтобы удалить

source: Download
hi: डाउनलोड
id: Unduh
pt: Transferências
ru: Скачать

source: Downloads
hi: डाउनलोड
id: Unduhan
pt: Transferências
ru: Загрузки

source: Invalid URL
hi: असामान्य यूआरएल
id: URL tidak valid
pt: URL inválida
ru: Неправильный адрес

# NoFi
source: Tap here to share without watermark
hi: वॉटरमार्क के बिना साझा करने के लिए यहां टैप करें
id: Ketuk di sini untuk berbagi tanpa tanda air
pt: Toque aqui para compartilhar sem marca d'água
ru: Нажмите здесь, чтобы поделиться без водяного знака

# NoFi2
source: Watch Without Watermark
hi: वॉटरमार्क के बिना देखें
id: Tonton Tanpa Tanda Air
pt: Assistir sem marca d'água
ru: Смотреть без водяных знаков

# OBV_Desc_1
source: Open TikTok and copy and paste the link to DoTik using the share button in the right corner.
hi: टिकटोक खोलें और दाएं कोने में शेयर बटन का उपयोग करके लिंक को DoTik पर कॉपी और पेस्ट करें।
id: Buka TikTok dan salin dan tempel tautan ke DoTik menggunakan tombol bagikan di sudut kanan.
pt: Abra o TikTok e copie e cole o link para o DoTik usando o botão de compartilhamento no canto direito.
ru: Откройте TikTok и скопируйте и вставьте ссылку на DoTik, используя кнопку «Поделиться» в правом углу.

# OBV_Desc_2
source: You can start an automatic download by opening TikTok and selecting DoTik on the share button in the right corner.
hi: आप टिकटॉक खोलकर और दाएं कोने में शेयर बटन पर DoTik का चयन करके एक स्वचालित डाउनलोड शुरू कर सकते हैं।
id: Anda dapat memulai pengunduhan otomatis dengan membuka TikTok dan memilih DoTik pada tombol bagikan di sudut kanan.
pt: Você pode iniciar um download automático abrindo o TikTok e selecionando DoTik no botão de compartilhamento no canto direito.
ru: Вы можете начать автоматическую загрузку, открыв TikTok и выбрав DoTik на кнопке «Поделиться» в правом углу.

# OBV_Desc_3
source: From the Downloads tab, you can watch or share their videos.
hi: डाउनलोड टैब से, आप उनके वीडियो देख या साझा कर सकते हैं।
id: Dari tab Unduhan, Anda dapat menonton atau membagikan video mereka.
pt: Na guia Downloads, você pode assistir ou compartilhar seus vídeos.
ru: На вкладке «Загрузки» вы можете смотреть или делиться их видео.

# OBV_GotIt
source: GOT IT
hi: समझ लिया
id: MENGERTI
pt: ENTENDI
ru: ПОНЯТНО

# OBV_Next
source: NEXT
hi: अगला
id: SELANJUTNYA
ru: СЛЕДУЮЩИЙ

# OBV_Skip
source: SKIP
hi: छोड़ें
id: MELEWATI
pt: PULAR
ru: ПРОПУСКАТЬ

# OBV_Title
source: Welcome DoTikTok Downloader
hi: आपका स्वागत है DoTikTok डाउनलोडर
id: Selamat Datang Pengunduh DoTikTok
pt: Bem-vindo DoTikTok Downloader
ru: Добро пожаловать в загрузчик DoTikTok

# OBV_Title_1
source: Copy it if you want
hi: आप चाहें तो इसे कॉपी कर लें
id: Salin jika Anda mau
pt: Copie-o se quiser
ru: Скопируйте его, если хотите

# OBV_Title_2
source: Use the share button if you want
hi: आप चाहें तो शेयर बटन का प्रयोग करें
id: Gunakan tombol bagikan jika Anda mau
pt: Use o botão de compartilhamento se quiser
ru: Используйте кнопку «Поделиться», если хотите

# OBV_Title_3
source: Easily share
hi: आसानी से साझा करें
id: Bagikan dengan mudah
pt: Compartilhe facilmente
ru: Легко поделиться

source: Paste
hi: पेस्ट करें
id: Tempel
pt: Colar
ru: Вставить

# PleaseEnter
source: Please enter a valid url and then press the download button.
hi: कृपया एक मान्य यूआरएल दर्ज करें और फिर डाउनलोड बटन दबाएं।
id: Silakan masukkan url yang valid lalu tekan tombol unduh.
pt: Insira um URL válido e pressione o botão de download.
ru: Пожалуйста, введите действительный URL-адрес, а затем нажмите кнопку загрузки.

# Rate
source: Rate the App
hi: एप्लिकेशन की श्रेणी बताओ
id: Nilai Aplikasinya
pt: Avalie o aplicativo
ru: Оцените приложение

source: Share
hi: साझा करना
id: Membagikan
pt: Compartilhado
ru: Доля

# SuccessDelete
source: Delete Successful.
hi: सफल हटाएं।
id: Hapus Berhasil.
pt: Excluir com sucesso.
ru: Удалить успешно.

# SuccessDownload
source: You can access the download from the successful downloads folder.
hi: आप डाउनलोड को सफल डाउनलोड फ़ोल्डर से एक्सेस कर सकते हैं।
id: Anda dapat mengakses unduhan dari folder unduhan yang berhasil.
pt: Você pode acessar o download na pasta de downloads bem-sucedidos.
ru: Вы можете получить доступ к загрузке из папки успешных загрузок.

# TiktokUrl
source: TikTok Link
hi: टिकटोक लिंक
id: Tautan TikTok
pt: Link do TikTok
ru: Ссылка на ТикТок

# Too
source: You are trading too often, please try again.
hi: आप बहुत बार व्यापार कर रहे हैं, कृपया पुनः प्रयास करें।
id: Anda terlalu sering berdagang, silakan coba lagi.
pt: Você está negociando com muita frequência, tente novamente.
ru: Вы торгуете слишком часто, попробуйте еще раз.

# Try
source: Please try again An error has occurred!
hi: कृपया पुन: प्रयास करें एक त्रुटि हुई है!
id: Silakan coba lagi Terjadi kesalahan!
pt: Por favor, tente novamente Ocorreu um erro!
ru: Пожалуйста, попробуйте еще раз Произошла ошибка!

# UrlPlaceholder
source: Paste the TikTok link here.
hi: यहां टिकटॉक लिंक पेस्ट करें।
id: Tempel tautan TikTok di sini.
pt: Cole o link do TikTok aqui.
ru: Вставьте сюда ссылку TikTok.

source: Video Player
hi: वीडियो प्लेयर
id: Pemutar video
pt: Leitor de vídeo
ru: Видео проигрыватель
